---
kind: method
id: M:Autodesk.Revit.DB.CompoundStructureLayer.#ctor(Autodesk.Revit.DB.CompoundStructureLayer)
source: html/6ed93e8c-9045-9099-44f7-4a92fc61ffa7.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.#ctor Method

Creates a copy of a compound structure layer.

## Syntax (C#)
```csharp
public CompoundStructureLayer(
	CompoundStructureLayer cs
)
```

## Parameters
- **cs** (`Autodesk.Revit.DB.CompoundStructureLayer`) - The compound structure to copy.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null